# Working with DataFrames

## Duplicates in DataFrames

In [21]:
# Imports
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

Lets get a dataframe with duplicates

In [8]:
# df creation
df = DataFrame({'col1': ['A', 'A'] + ['B','B','B'] ,
                'col2': [2, 2, 2, 3, 3]})

#Show
df

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

We can use duplicated method to find duplicates inside the df

In [18]:
# find duplicate
df.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

We can also drop duplicates using the "drop_duplicates" method. It drops the couple of duplicate on axis 1. Pay attention, it drops the first duplicated scrolling from up to down in the columns.

In [20]:
# drop duplicates
df.drop_duplicates()

  col1  col2
0    A     2
2    B     2
3    B     3

In [11]:
# show the original df
df

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

We can filter which duplicates to drop by a single column

In [12]:
# Chose the column (keep = 'first' is by default)
df.drop_duplicates(['col1'])

  col1  col2
0    A     2
2    B     2

In [13]:
# Chose the column
dframe.drop_duplicates(['col2'])

  col1  col2
0    A     2
3    B     3

In [6]:
#Show original
dframe

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

We can also take the last value instead

In [17]:
# To take the last we have to specify it on the "keep" parameter
df.drop_duplicates(['col1'], keep='last')

  col1  col2
1    A     2
4    B     3

# Nice let's see some exercise!